Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.1.162/include/pio/pic32cm5164le00048.h
#define PIN_PA17H_GCLK_IO3                         _UINT32_(17)
#define MUX_PA17H_GCLK_IO3                         _UINT32_(7) 
#define PINMUX_PA17H_GCLK_IO3                      ((PIN_PA17H_GCLK_IO3 << 16) | MUX_PA17H_GCLK_IO3)
#define PORT_PA17H_GCLK_IO3                        (_UINT32_(1) << 17)

#define PIN_PA10H_GCLK_IO4                         _UINT32_(10)
#define MUX_PA10H_GCLK_IO4                         _UINT32_(7) 
#define PINMUX_PA10H_GCLK_IO4                      ((PIN_PA10H_GCLK_IO4 << 16) | MUX_PA10H_GCLK_IO4)
#define PORT_PA10H_GCLK_IO4                        (_UINT32_(1) << 10)

#define PIN_PA20H_GCLK_IO4                         _UINT32_(20)
#define MUX_PA20H_GCLK_IO4                         _UINT32_(7) 
#define PINMUX_PA20H_GCLK_IO4                      ((PIN_PA20H_GCLK_IO4 << 16) | MUX_PA20H_GCLK_IO4)
#define PORT_PA20H_GCLK_IO4                        (_UINT32_(1) << 20)

#define PIN_PA21H_GCLK_IO5                         _UINT32_(21)
#define MUX_PA21H_GCLK_IO5                         _UINT32_(7) 
#define PINMUX_PA21H_GCLK_IO5                      ((PIN_PA21H_GCLK_IO5 << 16) | MUX_PA21H_GCLK_IO5)
#define PORT_PA21H_GCLK_IO5                        (_UINT32_(1) << 21)

/* ========== PORT definition for I2S peripheral ========== */
#define PIN_PA11K_I2S_FS0                          _UINT32_(11)
#define MUX_PA11K_I2S_FS0                          _UINT32_(10)
#define PINMUX_PA11K_I2S_FS0                       ((PIN_PA11K_I2S_FS0 << 16) | MUX_PA11K_I2S_FS0)
#define PORT_PA11K_I2S_FS0                         (_UINT32_(1) << 11)

#define PIN_PA18K_I2S_FS0                          _UINT32_(18)
#define MUX_PA18K_I2S_FS0                          _UINT32_(10)
#define PINMUX_PA18K_I2S_FS0                       ((PIN_PA18K_I2S_FS0 << 16) | MUX_PA18K_I2S_FS0)
#define PORT_PA18K_I2S_FS0                         (_UINT32_(1) << 18)

#define PIN_PA09K_I2S_MCK0                         _UINT32_(9) 
#define MUX_PA09K_I2S_MCK0                         _UINT32_(10)
#define PINMUX_PA09K_I2S_MCK0                      ((PIN_PA09K_I2S_MCK0 << 16) | MUX_PA09K_I2S_MCK0)
#define PORT_PA09K_I2S_MCK0                        (_UINT32_(1) << 9)

#define PIN_PA10K_I2S_SCK0                         _UINT32_(10)
#define MUX_PA10K_I2S_SCK0                         _UINT32_(10)
#define PINMUX_PA10K_I2S_SCK0                      ((PIN_PA10K_I2S_SCK0 << 16) | MUX_PA10K_I2S_SCK0)
#define PORT_PA10K_I2S_SCK0                        (_UINT32_(1) << 10)

#define PIN_PA20K_I2S_SCK0                         _UINT32_(20)
#define MUX_PA20K_I2S_SCK0                         _UINT32_(10)
#define PINMUX_PA20K_I2S_SCK0                      ((PIN_PA20K_I2S_SCK0 << 16) | MUX_PA20K_I2S_SCK0)
#define PORT_PA20K_I2S_SCK0                        (_UINT32_(1) << 20)

#define PIN_PA21K_I2S_SCK1                         _UINT32_(21)
#define MUX_PA21K_I2S_SCK1                         _UINT32_(10)
#define PINMUX_PA21K_I2S_SCK1                      ((PIN_PA21K_I2S_SCK1 << 16) | MUX_PA21K_I2S_SCK1)
#define PORT_PA21K_I2S_SCK1                        (_UINT32_(1) << 21)

#define PIN_PA08K_I2S_SDI                          _UINT32_(8) 
#define MUX_PA08K_I2S_SDI                          _UINT32_(10)
#define PINMUX_PA08K_I2S_SDI                       ((PIN_PA08K_I2S_SDI << 16) | MUX_PA08K_I2S_SDI)
#define PORT_PA08K_I2S_SDI                         (_UINT32_(1) << 8)

#define PIN_PA19K_I2S_SDO                          _UINT32_(19)
#define MUX_PA19K_I2S_SDO                          _UINT32_(10)
#define PINMUX_PA19K_I2S_SDO                       ((PIN_PA19K_I2S_SDO << 16) | MUX_PA19K_I2S_SDO)
#define PORT_PA19K_I2S_SDO                         (_UINT32_(1) << 19)

/* ========== PORT definition for OPAMP peripheral ========== */
#define PIN_PA02B_OPAMP_OANEG0                     _UINT32_(2) 
#define MUX_PA02B_OPAMP_OANEG0                     _UINT32_(1) 
#define PINMUX_PA02B_OPAMP_OANEG0                  ((PIN_PA02B_OPAMP_OANEG0 << 16) | MUX_PA02B_OPAMP_OANEG0)
#define PORT_PA02B_OPAMP_OANEG0                    (_UINT32_(1) << 2)

#define PIN_PA00B_OPAMP_OANEG1                     _UINT32_(0) 
#define MUX_PA00B_OPAMP_OANEG1                     _UINT32_(1) 
#define PINMUX_PA00B_OPAMP_OANEG1                  ((PIN_PA00B_OPAMP_OANEG1 << 16) | MUX_PA00B_OPAMP_OANEG1)
#define PORT_PA00B_OPAMP_OANEG1                    (_UINT32_(1) << 0)

#define PIN_PA03B_OPAMP_OANEG2                     _UINT32_(3) 
#define MUX_PA03B_OPAMP_OANEG2                     _UINT32_(1) 
#define PINMUX_PA03B_OPAMP_OANEG2                  ((PIN_PA03B_OPAMP_OANEG2 << 16) | MUX_PA03B_OPAMP_OANEG2)
#define PORT_PA03B_OPAMP_OANEG2                    (_UINT32_(1) << 3)

#define PIN_PA07B_OPAMP_OAOUT0                     _UINT32_(7) 
#define MUX_PA07B_OPAMP_OAOUT0                     _UINT32_(1) 
#define PINMUX_PA07B_OPAMP_OAOUT0                  ((PIN_PA07B_OPAMP_OAOUT0 << 16) | MUX_PA07B_OPAMP_OAOUT0)
#define PORT_PA07B_OPAMP_OAOUT0                    (_UINT32_(1) << 7)

#define PIN_PA04B_OPAMP_OAOUT2                     _UINT32_(4) 
#define MUX_PA04B_OPAMP_OAOUT2                     _UINT32_(1) 
#define PINMUX_PA04B_OPAMP_OAOUT2                  ((PIN_PA04B_OPAMP_OAOUT2 << 16) | MUX_PA04B_OPAMP_OAOUT2)
#define PORT_PA04B_OPAMP_OAOUT2                    (_UINT32_(1) << 4)

#define PIN_PA06B_OPAMP_OAPOS0                     _UINT32_(6) 
#define MUX_PA06B_OPAMP_OAPOS0                     _UINT32_(1) 
#define PINMUX_PA06B_OPAMP_OAPOS0                  ((PIN_PA06B_OPAMP_OAPOS0 << 16) | MUX_PA06B_OPAMP_OAPOS0)
#define PORT_PA06B_OPAMP_OAPOS0                    (_UINT32_(1) << 6)

#define PIN_PA01B_OPAMP_OAPOS1                     _UINT32_(1) 
#define MUX_PA01B_OPAMP_OAPOS1                     _UINT32_(1) 
#define PINMUX_PA01B_OPAMP_OAPOS1                  ((PIN_PA01B_OPAMP_OAPOS1 << 16) | MUX_PA01B_OPAMP_OAPOS1)
#define PORT_PA01B_OPAMP_OAPOS1                    (_UINT32_(1) << 1)

#define PIN_PA05B_OPAMP_OAPOS2                     _UINT32_(5) 
#define MUX_PA05B_OPAMP_OAPOS2                     _UINT32_(1) 
#define PINMUX_PA05B_OPAMP_OAPOS2                  ((PIN_PA05B_OPAMP_OAPOS2 << 16) | MUX_PA05B_OPAMP_OAPOS2)
#define PORT_PA05B_OPAMP_OAPOS2                    (_UINT32_(1) << 5)

